Catalogs/ЭтапыРаботыСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЭтапыРаботыСКандидатами</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКандидатовНаЗадержку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПроверкиКандидатовНаЗадержку</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияЗадержкиКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейДоСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтклонятьЗадержавшихсяКандидатов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтклоненияЗадержавшихсяКандидатов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияЗадержкиКандидатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейДоОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпособыОпределенияЗадержкиКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыОпределенияЗадержкиКандидатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КакЗаданоВНастройках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КакЗаданоВЭтапе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЭтапыРаботыСКандидатами/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки,
		"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

Функция СтруктураДанныхПланированияЭтапа() Экспорт
	
	СтруктураДанныхЭтапа = Новый Структура("
	| Период, 
	| ПериодОкончание,
	| Помещение,
	| Бронь");
	
	Возврат СтруктураДанныхЭтапа;
	
КонецФункции

Функция ПараметрыПланируемогоЭтапа(Знач Кандидаты, Этап) Экспорт
	
	ПараметрыПланируемогоЭтапа = Новый Структура;
	ПараметрыПланируемогоЭтапа.Вставить("Кандидаты", Кандидаты);
	ПараметрыПланируемогоЭтапа.Вставить("Этап", Этап);
	ПараметрыПланируемогоЭтапа.Вставить("Вакансия");
	ПараметрыПланируемогоЭтапа.Вставить("Помещение");
	ПараметрыПланируемогоЭтапа.Вставить("Развернуто", Ложь);
	
	Видеособеседования.ДополнитьПараметрыПланируемогоЭтапа(ПараметрыПланируемогоЭтапа);
	
	Возврат ПараметрыПланируемогоЭтапа;
	
КонецФункции

Функция ОписаниеПланируемогоЭтапа(Параметры) Экспорт
	
	Кандидаты = Параметры.Кандидаты;
	Этап = Параметры.Этап;
	Вакансия = Параметры.Вакансия;
	Помещение = Параметры.Помещение;
	Развернуто = Параметры.Развернуто;
	
	Если ТипЗнч(Кандидаты) = Тип("СправочникСсылка.Кандидаты") Тогда
		Кандидаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Кандидаты);
	КонецЕсли;
	
	Если Вакансия = Неопределено Тогда
		Вакансия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Кандидаты[0], "Вакансия");
	КонецЕсли;
	
	КолВоКандидатов = Кандидаты.Количество();
	
	Если КолВоКандидатов > 1 Тогда
		
		Если Развернуто Тогда
			ПредставлениеКандидатов = "с:";
			Для Каждого Кандидат Из Кандидаты Цикл
				ПредставлениеКандидатов = ПредставлениеКандидатов + Символы.ПС + СтрШаблон(НСтр("ru = '%1'"), Кандидат);
			КонецЦикла;
		Иначе
			ПредставлениеКандидатов = СтрШаблон(НСтр("ru = 'с кандидатом %1 и еще %2'"), Кандидаты[0], КолВоКандидатов - 1);
		КонецЕсли;
		
	Иначе
		ПредставлениеКандидатов = СтрШаблон(НСтр("ru = 'с кандидатом %1'"), Кандидаты[0]);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Помещение) Тогда
		ТекстОписания = НСтр("ru = '%1. %2 %3 на вакансию %4'");
		Описание = СтрШаблон(ТекстОписания, Помещение, Этап, ПредставлениеКандидатов, Вакансия);
	Иначе
		ТекстОписания = НСтр("ru = '%1 %2 на вакансию %3'");
		Описание = СтрШаблон(ТекстОписания, Этап, ПредставлениеКандидатов, Вакансия);
	КонецЕсли;
	
	Видеособеседования.ДополнитьОписаниеПланируемогоЭтапа(Параметры, Описание);
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение
//
Процедура НачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	Справочник.ЭтапыРаботыСКандидатами КАК ЭтапыРаботыСКандидатами");
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтапыРаботы = Новый Массив;
	ЭтапыРаботы.Добавить(НСтр("ru = 'Первичный контакт'"));
	ЭтапыРаботы.Добавить(НСтр("ru = 'Собеседование'"));
	ЭтапыРаботы.Добавить(НСтр("ru = 'Тестирование'"));
	ЭтапыРаботы.Добавить(НСтр("ru = 'Рассмотрение руководителем'"));
	ЭтапыРаботы.Добавить(НСтр("ru = 'Собеседование с руководителем'"));
	
	Индекс = 1;
	Для Каждого Этап Из ЭтапыРаботы Цикл
		НовыйЭлемент = Справочники.ЭтапыРаботыСКандидатами.СоздатьЭлемент();
		НовыйЭлемент.Наименование = Этап;
		НовыйЭлемент.РеквизитДопУпорядочивания = Индекс;
		НовыйЭлемент.ОбменДанными.Загрузка = Истина;
		НовыйЭлемент.Записать();
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

#Область ОбновлениеИнформационнойБазы

// Процедура выполняет заполнение настроек контроля задержки кандидатов в этапах
//
// Параметры:
//  ПараметрыОбновления  - Структура - описывает текущие параметры обновления
//
Процедура ЗаполнитьНастройкиКонтроляЗадержкиКандидатов(ПараметрыОбновления) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЭтапыРаботыСКандидатами.Ссылка КАК ЭтапРаботы
	|ИЗ
	|	Справочник.ЭтапыРаботыСКандидатами КАК ЭтапыРаботыСКандидатами
	|ГДЕ
	|	ЭтапыРаботыСКандидатами.СпособПроверкиКандидатовНаЗадержку = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияЗадержкиКандидатов.ПустаяСсылка)");
	
	Если Запрос.Выполнить().Пустой() Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭтапРаботы = Выборка.ЭтапРаботы.ПолучитьОбъект();
		ЭтапРаботы.ПроверятьКандидатовНаЗадержку = Истина;
		ЭтапРаботы.СпособПроверкиКандидатовНаЗадержку = Перечисления.СпособыОпределенияЗадержкиКандидатов.КакЗаданоВНастройках;
		ЭтапРаботы.ДнейДоСообщения = 30;
		ЭтапРаботы.ОтклонятьЗадержавшихсяКандидатов = Истина;
		ЭтапРаботы.СпособОтклоненияЗадержавшихсяКандидатов = Перечисления.СпособыОпределенияЗадержкиКандидатов.КакЗаданоВНастройках;
		ЭтапРаботы.ДнейДоОтклонения = 60;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЭтапРаботы);
	КонецЦикла;
	
	ПараметрыОбновления.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
